
# import pandas as pd


# №1 =====================
# s = pd.Series([12, 15, 8, 20, 25, 30, 10], index=['Пн', 'Вт', 'Ср', 'Чт', 'Пт', 'Сб', 'Вс'])
# print(s)
# print("*" * 50)
# filtered_data = s[s > 15]
# print(filtered_data)


# №2 ======================
# s = pd.Series([85, 90, 78, 92, 88, 76, 95, 92], index=['Аня', 'Боря', 'Влад', 'Глаша', 'Дима', 'Ева', 'Жора', 'Зина'])
# print(s)
#
# print("*" * 50)
#
# print(s.nlargest(3))


# №3 ======================
# s = pd.Series([16, 25, 38, 17, 42, 15])
# s_new = s>=18
# print(s_new)









# import pandas as pd
# import numpy as np

# №1 =======================

# data = {
#     'Имя': ['Анна', 'Борис', 'Влад', 'Ольга'],
#     'Возраст': [25, 34, 41, 28],
#     'Город': ['Москва', 'Санкт-Петербург', 'Казань', 'Сочи']
# }
#
# df = pd.DataFrame(data)
# print(df)
#
# print("*" * 50)
#
# print(df[df['Возраст'] > 30])



# №2 =======================

# data = {
#     'Имя': ['Анна', 'Борис', 'Влад', 'Ольга', 'Марина', 'Роман', 'Екатерина', 'Виктор', 'Ирина'],
#     'Возраст': [25, 34, 41, 28, 19, 20, 36, 41, 38],
#     'Город': ['Москва', 'Санкт-Петербург', 'Казань', 'Сочи', 'Санкт-Петербург', 'Москва', 'Санкт-Петербург', 'Казань', 'Сочи']
# }
#
# df = pd.DataFrame(data)
# print(df)
#
# print("*" * 50)
#
# print(df.groupby("Город")["Возраст"].mean())



# №3 =======================

# data = {
#     'Имя': ['Анна', 'Борис', 'Влад', 'Ольга', 'Марина', 'Роман', 'Екатерина', 'Виктор', 'Ирина'],
#     'Возраст': [25, 34, 41, 28, 19, 20, 36, 41, 38],
#     'Город': ['Москва', 'Санкт-Петербург', 'Казань', 'Сочи', 'Санкт-Петербург', 'Москва', 'Санкт-Петербург', 'Казань', 'Сочи']
# }
#
# df = pd.DataFrame(data)
# print(df)
#
# print("*" * 50)
#
# df['Статус'] = np.where(df['Возраст'] >= 30, 'Взрослый', 'Молодой')
#
# print(df)



# №4 =======================

# data = {
#     'Имя товара': ['Монитор', np.nan, 'Мышка', 'Клавиатура'],
#     'Продажи': [15000, 23000, np.nan, 8000]
# }
#
# df = pd.DataFrame(data)
# print(df)
#
# print("*" * 50)
#
# df = df.dropna(subset=['Имя товара'])
#
# ms = df['Продажи'].mean()
#
# df['Продажи'] = df['Продажи'].fillna(ms)
#
# print(df)